export default function Description({ description }: { description: string }) {
  return (
    <div className="mt-5 description text-[15px] leading-9 text-neutral-500  text-justify">
      <div dangerouslySetInnerHTML={{ __html: description }}></div>
    </div>
  );
}

/* const description = `<div class="d-flex flex-column">
				<h3 class="fw-500 text-dark-blue fs-5s">معرفی کتاب</h3>
				<div class="fs-7 fw-300 text-justify text-dark-blue lh-lg" itemprop="description"><p><span style="font-weight:400;">کتاب<strong> نماز باحال</strong> نوشته <strong>سید کاظم روح‌بخش </strong>به بررسی نماز به‌عنوان سفری معنوی و لذت‌بخش، نگاه تازه‌ای برای خوانندگان ایجاد می‌کند و آنان را از کلیشه‌های رایج دور می‌سازد.</span></p>
<p><span style="font-weight:400;">این کتاب به خواننده نشان می‌دهد که نماز صرفاً یک وظیفه دینی نیست، بلکه فرصتی برای برقراری ارتباط عمیق با خداوند و دستیابی به آرامش درونی است.</span></p>
<p><span style="font-weight:400;">بخش "سفر به دنیای درون" به خواننده کمک می‌کند تا شناخت بهتری از خود پیدا کند و از طریق این آگاهی، مسیر رشد فردی و معنوی خویش را بیابد. با نگارشی جذاب و داستان‌گونه، کتاب انگیزه‌ای در خواننده ایجاد می‌کند تا به نماز نگاهی جدی‌تر داشته باشد و از آن لذت ببرد، نه اینکه تنها از روی عادت یا اجبار آن را به‌جا بیاورد.</span></p>
<p><span style="font-weight:400;">نماز باحال، به خواننده نشان می‌دهد که نماز می‌تواند سفری به درون، ماجراجویی‌ای معنوی و لحظه‌ای ویژه برای رسیدن به آرامش باشد. درک عمیق‌تر از نماز به خواننده این امکان را می‌دهد که از آن به‌عنوان راهی برای دستیابی به آرامش و رهایی از استرس استفاده کند.</span></p>
<p><span style="font-weight:400;">کتاب نماز باحال با رویکردی مثبت، ساده و شیرین به موضوع دین‌داری می‌پردازد و به‌ویژه نوجوانان را با این پیام همراه می‌کند که پایبندی به دین می‌تواند جذاب و دوست‌داشتنی باشد. با بهره‌گیری از نکته‌های آموزنده کتاب، خواننده قادر خواهد بود تغییرات مثبت و پایدار در سبک زندگی خود ایجاد کند.</span></p>
<h2>&nbsp;</h2>
<h2 class="fs-6"><br>در ادامه به برخی از ویژگی‌های جذاب کتاب نماز باحال را اشاره می‌کنیم:&nbsp;</h2>
<p><span style="font-weight:400;">کتاب با تصویرسازی دنیای درون به‌عنوان شهری، قلب را میدان اصلی شهر معرفی می‌کند و مغز را برج فرماندهی آن می‌داند. چنین مدل‌هایی به خواننده کمک می‌کنند تا مفاهیم پیچیده را به‌سادگی درک کند و با آن‌ها ارتباط برقرار نماید. به جای ارائه یک متن آموزشی خشک، از روایت داستانی بهره گرفته شده‌ است. سفر با کوله‌پشتی و تجربه ماجراجویی به کتاب حس کشف و جذابیت می‌بخشد. پرداختن به "سفر به دنیای درون" سبب شده است که کتاب علاوه‌بر موضوع نماز، در زمینه رشد شخصی و خودشناسی نیز اثربخش باشد.</span></p>
<p><span style="font-weight:400;">استفاده از زبانی صمیمی و طنزآلود، فضایی دوستانه ایجاد کرده است که خواننده را به ادامه مطالعه مشتاق می‌کند.</span></p>
<p><span style="font-weight:400;">کتاب نماز باحال نه‌تنها درباره اهمیت نماز صحبت می‌کند، بلکه راهکارهایی برای تجربه‌ای بهتر و معنوی‌تر در نماز ارائه می‌دهد و همین ویژگی آن را منحصربه‌فرد و کاربردی ساخته است.</span></p>
<p><span style="font-weight:400;">بخش چهارم کتاب، با عنوان "چگونه دیگران را به نماز دعوت کنیم؟"، رویکردی اجتماعی و الهام‌بخش دارد که در کمتر کتاب دیگری دیده می‌شود.</span></p>
<p><span style="font-weight:400;">کتاب نماز باحال، کاری از انتشارات<strong> واژه پرداز اندیشه</strong> می‌باشد.</span></p>
<p>&nbsp;</p>
<p>&nbsp;</p>
<h2 class="fs-6">کتاب نماز باحال را به چه کسانی پیشنهاد می‌کنیم؟</h2>
<p><span style="font-weight:400;">-نوجوانانی که به دنبال نگاهی نو و جذاب به نماز هستند.&nbsp;&nbsp;</span></p>
<p><span style="font-weight:400;">سبک روایی و تصویرسازی خلاقانه باعث می‌شود این گروه سنی ارتباط بهتری با مفهوم کتاب برقرار کنند.</span></p>
<p><span style="font-weight:400;">-کسانی که با نماز فاصله دارند و به‌دنبال انگیزه‌اند.</span></p>
<p><span style="font-weight:400;">-کسانی که به دنبال تغییر فرزند و همسر خود، نسبت به نماز هستند.</span></p>
<p><span style="font-weight:400;">رویکرد کتاب برای تبدیل نماز به موقعیتی شخصی و لذت‌بخش می‌تواند برای این افراد الهام‌بخش باشد.</span></p>
<p><span style="font-weight:400;">-والدین و مربیانی که با نوجوانان سر و کار دارند.&nbsp;</span></p>
<p><span style="font-weight:400;">این کتاب ابزاری فوق‌العاده برای ایجاد ارتباط بهتر با نوجوانان و آموزش غیرمستقیم نماز به آنان است.</span></p></div>

								<div class="d-flex flex-row mt-4 flex-wrap gap-1">
																		</div>
							</div>`;
 */
