import ContentHeader from "../../components/Assets/ContentHeader";
import { MenuBookOutline } from "../../components/Icons/MenuBookOutline";

type Props = {};

const bookSections = [
  {
    title: "محتوا و آموزش",
    content: `اینجا مجموعه‌ای از آموزش‌های هدفمند، کاربردی و الهام‌بخش برای شما آماده شده؛ آموزش‌هایی که هرکدام، بخشی از آن چیزی هستند که یک «سرباز آماده برای امام زمان (عج)» باید بلد باشد.

اگر به دنبال رشد فردی هستید، آموزش‌های ما به شما کمک می‌کنند تا توانایی‌ها و مهارت‌های شخصی‌تان را تقویت کنید.
اگر می‌خواهید شناخت عمیق‌تری از مهدویت و باورهای دینی پیدا کنید، اینجا محتوایی ساده، دقیق و قابل فهم در اختیارتان قرار می‌گیرد.
و اگر مشتاقید در فضای مجازی اثرگذار باشید و مهارت‌های روز را یاد بگیرید، این بخش برای شما طراحی شده است.

از شما دعوت می‌کنیم این آموزش‌ها را دنبال کرده و گام‌به‌گام، خودتان را برای ایفای نقش مؤثر در جامعه و آمادگی برای ظهور، توانمندتر کنید.`,
  },
  {
    title: "عملیات",
    content: `
    در بخش «عملیات»، وقت آن رسیده که آموخته‌ها را به میدان عمل ببریم.
اینجا جایی‌ست برای کسانی که آماده‌اند وارد صحنه شوند و نسبت به اتفاقات اطراف بی‌تفاوت نباشند.

فرقی نمی‌کند اتفاقی مهم در جامعه در حال رخ دادن باشد یا مناسبت تقویمی باشد؛ در «کوله مهدیار» ما همیشه آماده‌ایم تا متناسب با شرایط روز و مناسبت‌ها، عملیات‌های دقیق، هدفمند و اثرگذار طراحی و اجرا کنیم.

اینجا «اتاق فرماندهی کوله مهدیار» است؛ جایی که تمام ایده‌های عملیاتی، در دو حوزه‌ی فضای حقیقی، فضای مجازی و حتی فعالیت‌های جزئی و فردی، به شکلی منظم و دقیق در اختیارتان قرار می‌گیرد.
از ایده‌های کوچک گرفته تا برنامه‌های جمعی، حتی فهرست وسایل موردنیاز برای اجرا، همه چیز برای شما آماده شده تا فقط یک کار بماند: بلند شدن و عمل کردن.
    `,
  },
  {
    title: "اید ها",
    content: `در این بخش  با «ایده‌ها» آشنا می‌شوید؛ جایی برای شروع حرکت‌های بزرگ، حتی با جیب خالی!
ایده‌هایی که در این بخش ارائه شده‌اند، طیفی متنوع از فعالیت‌های بی‌هزینه، کم‌هزینه و هزینه‌دار را شامل می‌شوند؛ برای هر کسی که می‌خواهد در هر زمان و هر شرایطی، قدمی بردارد برای ساختن حال خوب اطرافیان و خوشحال کردن امام زمان (عج).

این بخش به شما نشان می‌دهد که برای اثرگذاری، لازم نیست امکانات زیاد داشته باشید. کافی‌ست نیت خالص و ذهنی خلاق داشته باشید تا بتوانید از دل ساده‌ترین کارها، تأثیرگذارترین اقدامات را خلق کنید؛ از پروژه‌های خیریه گرفته تا ایده‌های روزمره که با یک فکر کوچک، تغییرات بزرگی ایجاد می‌کنند.

اینجا همه چیز آماده شده تا شما فقط انتخاب کنید و آغازگر یک اتفاق خوب باشید!`,
  },
];
export default function BookSections({}: Props) {
  return (
    <div>
      <ContentHeader Icon={MenuBookOutline} title="بخش های کتاب" />
      <div className="space-y-3">
        {bookSections.map((section, index) => (
          <div
            key={index}
            className="collapse collapse-arrow bg-base-100 border border-base-300"
          >
            <input type="radio" name="my-accordion-2" />
            <div className="collapse-title font-semibold">{section.title}</div>
            <div className="collapse-content leading-8 text-hgray-600 text-sm">
              {section.content}
            </div>
          </div>
        ))}
      </div>
    </div>
  );
}
